Daniele Parimbelli<br>Data Scientist at Vedrai<br>e-mail: daniele.parimbelli@vedrai.com

In [ ]:
%pip install ipython-sql==0.5.0

Load the SQL extension

In [2]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Why SQLite?

Unlike other databases that require a server setup, SQLite is a self-contained database integrated with the application that accesses it and doesnâ€™t need installation or configuration. You can interact with the SQLite database simply by reading and writing directly from the database files stored on disk.

https://www.sqlitetutorial.net/what-is-sqlite/

By default SQLite stores the entire database in a single disk file

In [3]:
%sql sqlite:///my_database.db

## Creating the tables

In [4]:
%%sql

CREATE TABLE departments (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    location TEXT
);

CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    first_name TEXT NOT NULL,
    last_name TEXT NOT NULL,
    department_id INTEGER,
    hire_date TEXT,  -- SQLite does not have type DATE
    salary REAL,
    bonus REAL,
    job_title TEXT,
    manager_id INTEGER,
    performance_rating INTEGER,
    email TEXT,
    phone_number TEXT,
    FOREIGN KEY (department_id) REFERENCES departments(id),
    FOREIGN KEY (manager_id) REFERENCES employees(id) -- self-referencing foreign key: every manager is also an employees, therefore manager_id is the manager's employee id.
);

INSERT INTO departments (id, name, location) VALUES
(1, 'Engineering', 'New York'),
(2, 'Sales', 'Los Angeles'),
(3, 'HR', 'Chicago'),
(4, 'Marketing', 'San Francisco'),
(5, 'Finance', 'Boston');

INSERT INTO employees (id, first_name, last_name, department_id, hire_date, salary, bonus, job_title, manager_id, performance_rating, email, phone_number) VALUES
(1, 'Alice', 'Smith',       1, '2010-06-01', 120000, 10000, 'CTO',                   NULL, 5, 'alice.smith@example.com', '555-0100'),
(2, 'Bob', 'Johnson',       1, '2012-09-15',  90000,  5000, 'Senior Engineer',       1, 4, 'bob.johnson@example.com', '555-0101'),
(3, 'Carol', 'Williams',    1, '2015-03-20',  80000,   NULL, 'Engineer',              2, 3, 'carol.williams@example.com', '555-0102'),
(4, 'David', 'Jones',       2, '2011-11-11',  95000,  7000, 'Sales Manager',         NULL, 4, 'david.jones@example.com', '555-0103'),
(5, 'Eva', 'Brown',         2, '2016-05-22',  70000,  3000, 'Sales Representative',  4, 3, 'eva.brown@example.com', '555-0104'),
(6, 'Frank', 'Davis',       2, '2018-07-01',  68000,   NULL, 'Sales Representative',  4, 2, 'frank.davis@example.com', '555-0105'),
(7, 'Grace', 'Miller',      3, '2013-02-28',  75000,  4000, 'HR Specialist',         NULL, 4, 'grace.miller@example.com', '555-0106'),
(8, 'Henry', 'Wilson',      3, '2019-10-10',  60000,  2000, 'HR Assistant',           7, 3, 'henry.wilson@example.com', '555-0107'),
(9, 'Ivy', 'Moore',         4, '2014-08-19',  85000,  5000, 'Marketing Manager',     NULL, 4, 'ivy.moore@example.com', '555-0108'),
(10, 'Sam', 'White',        NULL, '2023-01-01', 50000, NULL, 'Intern',                3, NULL, NULL, NULL),
(11, 'Jack', 'Taylor',      4, '2020-01-15',  65000,   NULL, 'Marketing Specialist',   9, 3, 'jack.taylor@example.com', '555-0109'),
(12, 'Kathy', 'Anderson',   5, '2017-04-03',  78000,  4500, 'Finance Analyst',       NULL, 4, 'kathy.anderson@example.com', '555-0110'),
(13, 'Leo', 'Thomas',       5, '2021-12-05',  55000,   NULL, 'Junior Finance Analyst',11, 3, 'leo.thomas@example.com', '555-0111');

 * sqlite:///my_database.db
Done.
Done.
5 rows affected.
13 rows affected.

[]

## Selecting columns

Selecting every column from a table

In [5]:
%%sql
SELECT * FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

Using aliases and selecting multiple columns

In [8]:
%%sql
SELECT first_name, last_name AS surname FROM employees

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith'),
 ('Bob', 'Johnson'),
 ('Carol', 'Williams'),
 ('David', 'Jones'),
 ('Eva', 'Brown'),
 ('Frank', 'Davis'),
 ('Grace', 'Miller'),
 ('Henry', 'Wilson'),
 ('Ivy', 'Moore'),
 ('Sam', 'White'),
 ('Jack', 'Taylor'),
 ('Kathy', 'Anderson'),
 ('Leo', 'Thomas')]

Selecting unique values

In [10]:
%%sql
SELECT DISTINCT job_title FROM employees

 * sqlite:///my_database.db
Done.

[('CTO',),
 ('Senior Engineer',),
 ('Engineer',),
 ('Sales Manager',),
 ('Sales Representative',),
 ('HR Specialist',),
 ('HR Assistant',),
 ('Marketing Manager',),
 ('Intern',),
 ('Marketing Specialist',),
 ('Finance Analyst',),
 ('Junior Finance Analyst',)]

Selecting unique combinations

In [12]:
%%sql
SELECT DISTINCT department_id, job_title
FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'CTO'),
 (1, 'Senior Engineer'),
 (1, 'Engineer'),
 (2, 'Sales Manager'),
 (2, 'Sales Representative'),
 (3, 'HR Specialist'),
 (3, 'HR Assistant'),
 (4, 'Marketing Manager'),
 (None, 'Intern'),
 (4, 'Marketing Specialist'),
 (5, 'Finance Analyst'),
 (5, 'Junior Finance Analyst')]

## Filtering rows

### Filtering based on numeric values

In [6]:
%%sql
SELECT * FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

In [14]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE performance_rating = 5

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith')]

In [15]:
%%sql
SELECT first_name, last_name, department_id
FROM employees
WHERE department_id != 3

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 1),
 ('Bob', 'Johnson', 1),
 ('Carol', 'Williams', 1),
 ('David', 'Jones', 2),
 ('Eva', 'Brown', 2),
 ('Frank', 'Davis', 2),
 ('Ivy', 'Moore', 4),
 ('Jack', 'Taylor', 4),
 ('Kathy', 'Anderson', 5),
 ('Leo', 'Thomas', 5)]

In [16]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE salary > 100000

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith')]

In [17]:
%%sql
SELECT first_name, last_name, salary
FROM employees
WHERE salary BETWEEN 90000 AND 100000

 * sqlite:///my_database.db
Done.

[('Bob', 'Johnson', 90000.0), ('David', 'Jones', 95000.0)]

In [18]:
%%sql
SELECT first_name, last_name, salary
FROM employees
WHERE salary NOT BETWEEN 90000 AND 100000

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 120000.0),
 ('Carol', 'Williams', 80000.0),
 ('Eva', 'Brown', 70000.0),
 ('Frank', 'Davis', 68000.0),
 ('Grace', 'Miller', 75000.0),
 ('Henry', 'Wilson', 60000.0),
 ('Ivy', 'Moore', 85000.0),
 ('Sam', 'White', 50000.0),
 ('Jack', 'Taylor', 65000.0),
 ('Kathy', 'Anderson', 78000.0),
 ('Leo', 'Thomas', 55000.0)]

### Filtering based on string values

In [7]:
%%sql
SELECT * FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

LIKE is used to search for a specified pattern in a column. It is commonly used with wildcard characters to match partial strings.

*%* is a wildcard that matches zero or more characters

In [20]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE last_name LIKE 'W%'

 * sqlite:///my_database.db
Done.

[('Carol', 'Williams'), ('Henry', 'Wilson'), ('Sam', 'White')]

In [21]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE first_name LIKE '%y'

 * sqlite:///my_database.db
Done.

[('Kathy', 'Anderson')]

In SQLite LIKE is case insensitive by default, in other dialects there is the ILIKE clause

In [22]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE last_name LIKE '%b%'

 * sqlite:///my_database.db
Done.

[('Eva', 'Brown')]

*_* is a wildcard that matches exactly one character

In [23]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE last_name LIKE '%a_'

 * sqlite:///my_database.db
Done.

[('Leo', 'Thomas')]

### Filtering based on NULL values

In [25]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE manager_id IS NULL

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith'),
 ('David', 'Jones'),
 ('Grace', 'Miller'),
 ('Ivy', 'Moore'),
 ('Kathy', 'Anderson')]

In [26]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE manager_id IS NOT NULL

 * sqlite:///my_database.db
Done.

[('Bob', 'Johnson'),
 ('Carol', 'Williams'),
 ('Eva', 'Brown'),
 ('Frank', 'Davis'),
 ('Henry', 'Wilson'),
 ('Sam', 'White'),
 ('Jack', 'Taylor'),
 ('Leo', 'Thomas')]

### Filtering based on multiple conditions

In [30]:
%%sql
SELECT first_name, last_name, salary, performance_rating
FROM employees
WHERE performance_rating < 4 AND salary > 70000

 * sqlite:///my_database.db
Done.

[('Carol', 'Williams', 80000.0, 3)]

In [31]:
%%sql
SELECT first_name, last_name, salary, performance_rating
FROM employees
WHERE performance_rating < 4 OR salary > 70000

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 120000.0, 5),
 ('Bob', 'Johnson', 90000.0, 4),
 ('Carol', 'Williams', 80000.0, 3),
 ('David', 'Jones', 95000.0, 4),
 ('Eva', 'Brown', 70000.0, 3),
 ('Frank', 'Davis', 68000.0, 2),
 ('Grace', 'Miller', 75000.0, 4),
 ('Henry', 'Wilson', 60000.0, 3),
 ('Ivy', 'Moore', 85000.0, 4),
 ('Jack', 'Taylor', 65000.0, 3),
 ('Kathy', 'Anderson', 78000.0, 4),
 ('Leo', 'Thomas', 55000.0, 3)]

In [36]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE (performance_rating < 4 OR salary > 70000) AND department_id = 2

 * sqlite:///my_database.db
Done.

[('Carol', 'Williams'),
 ('David', 'Jones'),
 ('Eva', 'Brown'),
 ('Frank', 'Davis'),
 ('Henry', 'Wilson'),
 ('Jack', 'Taylor'),
 ('Leo', 'Thomas')]

In [37]:
%%sql
SELECT first_name, last_name, department_id
FROM employees
WHERE department_id = 1 OR department_id = 4

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 1),
 ('Bob', 'Johnson', 1),
 ('Carol', 'Williams', 1),
 ('Ivy', 'Moore', 4),
 ('Jack', 'Taylor', 4)]

When dealing with multiple conditions on the same column, using multiple OR conditions is not ideal.
Solution: using the IN keyword.

In [38]:
%%sql
SELECT first_name, last_name, department_id
FROM employees
WHERE department_id IN (1, 4)

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 1),
 ('Bob', 'Johnson', 1),
 ('Carol', 'Williams', 1),
 ('Ivy', 'Moore', 4),
 ('Jack', 'Taylor', 4)]

In [40]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE last_name NOT IN ("Johnson", "Smith")

 * sqlite:///my_database.db
Done.

[('Carol', 'Williams'),
 ('David', 'Jones'),
 ('Eva', 'Brown'),
 ('Frank', 'Davis'),
 ('Grace', 'Miller'),
 ('Henry', 'Wilson'),
 ('Ivy', 'Moore'),
 ('Sam', 'White'),
 ('Jack', 'Taylor'),
 ('Kathy', 'Anderson'),
 ('Leo', 'Thomas')]

## Ordering the results

In [10]:
%%sql
SELECT *
FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

The default ordering is ascending

In [41]:
%%sql
SELECT last_name, first_name
FROM employees
ORDER BY last_name

 * sqlite:///my_database.db
Done.

[('Anderson', 'Kathy'),
 ('Brown', 'Eva'),
 ('Davis', 'Frank'),
 ('Johnson', 'Bob'),
 ('Jones', 'David'),
 ('Miller', 'Grace'),
 ('Moore', 'Ivy'),
 ('Smith', 'Alice'),
 ('Taylor', 'Jack'),
 ('Thomas', 'Leo'),
 ('White', 'Sam'),
 ('Williams', 'Carol'),
 ('Wilson', 'Henry')]

In [45]:
%%sql
SELECT last_name, first_name
FROM employees
ORDER BY last_name DESC

 * sqlite:///my_database.db
Done.

[('Wilson', 'Henry'),
 ('Williams', 'Carol'),
 ('White', 'Sam'),
 ('Thomas', 'Leo'),
 ('Taylor', 'Jack'),
 ('Smith', 'Alice'),
 ('Moore', 'Ivy'),
 ('Miller', 'Grace'),
 ('Jones', 'David'),
 ('Johnson', 'Bob'),
 ('Davis', 'Frank'),
 ('Brown', 'Eva'),
 ('Anderson', 'Kathy')]

When ordering the results, NULL is considered the smallest value

In [47]:
%%sql
SELECT last_name, first_name, performance_rating
FROM employees
ORDER BY performance_rating DESC, last_name ASC

 * sqlite:///my_database.db
Done.

[('Smith', 'Alice', 5),
 ('Anderson', 'Kathy', 4),
 ('Johnson', 'Bob', 4),
 ('Jones', 'David', 4),
 ('Miller', 'Grace', 4),
 ('Moore', 'Ivy', 4),
 ('Brown', 'Eva', 3),
 ('Taylor', 'Jack', 3),
 ('Thomas', 'Leo', 3),
 ('Williams', 'Carol', 3),
 ('Wilson', 'Henry', 3),
 ('Davis', 'Frank', 2),
 ('White', 'Sam', None)]

## Limiting the results

In [49]:
%%sql
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC
LIMIT 3

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 120000.0),
 ('David', 'Jones', 95000.0),
 ('Bob', 'Johnson', 90000.0)]

OFFSET can be used to specify where to begin counting the rows from.

In [52]:
%%sql
SELECT first_name, last_name, salary
FROM employees
ORDER BY salary DESC
LIMIT 1 OFFSET 1

 * sqlite:///my_database.db
Done.

[('David', 'Jones', 95000.0)]

## Using mathematical expressions

* Addition: +
* Subtraction: -
* Multiplication: *
* Division: /
* Exponentiation: ^
* Modulus: %

In [9]:
%%sql
SELECT *
FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

In [55]:
%%sql
SELECT first_name, last_name, salary + bonus AS total_salary
FROM employees
WHERE bonus IS NOT NULL

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 130000.0),
 ('Bob', 'Johnson', 95000.0),
 ('David', 'Jones', 102000.0),
 ('Eva', 'Brown', 73000.0),
 ('Grace', 'Miller', 79000.0),
 ('Henry', 'Wilson', 62000.0),
 ('Ivy', 'Moore', 90000.0),
 ('Kathy', 'Anderson', 82500.0)]

In [60]:
%%sql
SELECT first_name, last_name, performance_rating
FROM employees
WHERE performance_rating % 2 = 0

 * sqlite:///my_database.db
Done.

[('Bob', 'Johnson', 4),
 ('David', 'Jones', 4),
 ('Frank', 'Davis', 2),
 ('Grace', 'Miller', 4),
 ('Ivy', 'Moore', 4),
 ('Kathy', 'Anderson', 4)]

## Using mathematical functions

* ROUND: rounding
* ABS: absolute value
* POWER: power
* CEIL: ceiling
* FLOOR: floor

In [66]:
%%sql
SELECT first_name, last_name, ROUND(salary/performance_rating, 0) AS salary_perf_ratio
FROM employees
WHERE salary/performance_rating > 25000

 * sqlite:///my_database.db
Done.

[('Carol', 'Williams', 26667.0), ('Frank', 'Davis', 34000.0)]

Even after rounding to no decimals, the salary still contains decimals because its type is REAL. To eliminate decimals altogether we can temporally convert its type to INTEGER using CAST

In [68]:
%%sql
SELECT CAST(salary AS INTEGER) AS salary
FROM employees

 * sqlite:///my_database.db
Done.

[(120000,),
 (90000,),
 (80000,),
 (95000,),
 (70000,),
 (68000,),
 (75000,),
 (60000,),
 (85000,),
 (50000,),
 (65000,),
 (78000,),
 (55000,)]

## Aggregation functions

* COUNT
* MIN
* MAX
* AVG
* SUM

In [11]:
%%sql
SELECT *
FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

In [70]:
%%sql
SELECT MIN(performance_rating) AS min_perf_rating
FROM employees

 * sqlite:///my_database.db
Done.

[(2,)]

In [73]:
%%sql
SELECT ROUND(AVG(salary), 2) AS avg_salary
FROM employees
WHERE performance_rating < 4

 * sqlite:///my_database.db
Done.

[(66333.33,)]

In [75]:
%%sql
SELECT COUNT(bonus) AS bonuses_given
FROM employees

 * sqlite:///my_database.db
Done.

[(8,)]

COUNT(*) counts all the rows, even those with all NULL values

In [76]:
%%sql
SELECT COUNT(*)
FROM employees

 * sqlite:///my_database.db
Done.

[(13,)]

In [77]:
%%sql
SELECT COUNT(DISTINCT department_id) AS n_departments
FROM employees

 * sqlite:///my_database.db
Done.

[(5,)]

In [78]:
%%sql
SELECT COUNT(bonus) / COUNT(*) AS perc_bonuses_given
FROM employees

 * sqlite:///my_database.db
Done.

[(0,)]

In [80]:
%%sql
SELECT ROUND(CAST(COUNT(bonus) AS REAL) / COUNT(*), 2) AS perc_bonuses_given
FROM employees

 * sqlite:///my_database.db
Done.

[(0.62,)]

In [83]:
%%sql
SELECT ROUND((1.0 * COUNT(bonus)) / COUNT(*), 2) AS perc_bonuses_given
FROM employees

 * sqlite:///my_database.db
Done.

[(0.62,)]

In [86]:
%%sql
SELECT ROUND((1.0 * COUNT(bonus)) / COUNT(*) *100, 2) AS perc_bonuses_given
FROM employees

 * sqlite:///my_database.db
Done.

[(61.54,)]

## Grouped aggregation functions

Aggregation functions can be used in conjunction with the GROUP BY clause to perform aggregations on groups of data in a column, rather than on all rows of a column.

In [13]:
%%sql
SELECT *
FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

In [90]:
%%sql
SELECT department_id, AVG(salary) AS avg_salary
FROM employees
WHERE department_id IS NOT NULL
GROUP BY department_id
ORDER BY avg_salary DESC

 * sqlite:///my_database.db
Done.

[(1, 96666.66666666667),
 (2, 77666.66666666667),
 (4, 75000.0),
 (3, 67500.0),
 (5, 66500.0)]

In [91]:
%%sql
SELECT department_id, performance_rating, AVG(salary) AS avg_salary
FROM employees
WHERE department_id IS NOT NULL
GROUP BY department_id, performance_rating
ORDER BY avg_salary DESC

 * sqlite:///my_database.db
Done.

[(1, 5, 120000.0),
 (2, 4, 95000.0),
 (1, 4, 90000.0),
 (4, 4, 85000.0),
 (1, 3, 80000.0),
 (5, 4, 78000.0),
 (3, 4, 75000.0),
 (2, 3, 70000.0),
 (2, 2, 68000.0),
 (4, 3, 65000.0),
 (3, 3, 60000.0),
 (5, 3, 55000.0)]

HAVING can be used to filter rows after a grouped aggregation

In [93]:
%%sql
SELECT department_id AS dept_id, AVG(performance_rating) AS avg_perf_rating
FROM employees
GROUP BY department_id
HAVING avg_perf_rating > 3

 * sqlite:///my_database.db
Done.

[(1, 4.0), (3, 3.5), (4, 3.5), (5, 3.5)]

## Query order of execution

1. FROM
2. WHERE
3. GROUP BY
4. HAVING
5. SELECT
6. ORDER BY
7. LIMIT

## String functions

In [12]:
%%sql
SELECT *
FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

String functions, like date functions, are different between SQL dialects

In [94]:
%%sql
SELECT first_name, last_name
FROM employees
WHERE LENGTH(first_name) = 5

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith'),
 ('Carol', 'Williams'),
 ('David', 'Jones'),
 ('Frank', 'Davis'),
 ('Grace', 'Miller'),
 ('Henry', 'Wilson'),
 ('Kathy', 'Anderson')]

In [98]:
%%sql
SELECT SUBSTR(phone_number, -1, -3)
FROM employees

 * sqlite:///my_database.db
Done.

[('010',),
 ('010',),
 ('010',),
 ('010',),
 ('010',),
 ('010',),
 ('010',),
 ('010',),
 ('010',),
 (None,),
 ('010',),
 ('011',),
 ('011',)]

In [99]:
%%sql
SELECT first_name || ' ' || last_name AS full_name
FROM employees

 * sqlite:///my_database.db
Done.

[('Alice Smith',),
 ('Bob Johnson',),
 ('Carol Williams',),
 ('David Jones',),
 ('Eva Brown',),
 ('Frank Davis',),
 ('Grace Miller',),
 ('Henry Wilson',),
 ('Ivy Moore',),
 ('Sam White',),
 ('Jack Taylor',),
 ('Kathy Anderson',),
 ('Leo Thomas',)]

In [100]:
%%sql
SELECT SUBSTR(first_name, 1, 1) || SUBSTR(last_name, 1, 1) AS initials
FROM employees

 * sqlite:///my_database.db
Done.

[('AS',),
 ('BJ',),
 ('CW',),
 ('DJ',),
 ('EB',),
 ('FD',),
 ('GM',),
 ('HW',),
 ('IM',),
 ('SW',),
 ('JT',),
 ('KA',),
 ('LT',)]

In [101]:
%%sql
SELECT first_name, UPPER(last_name)
FROM employees

 * sqlite:///my_database.db
Done.

[('Alice', 'SMITH'),
 ('Bob', 'JOHNSON'),
 ('Carol', 'WILLIAMS'),
 ('David', 'JONES'),
 ('Eva', 'BROWN'),
 ('Frank', 'DAVIS'),
 ('Grace', 'MILLER'),
 ('Henry', 'WILSON'),
 ('Ivy', 'MOORE'),
 ('Sam', 'WHITE'),
 ('Jack', 'TAYLOR'),
 ('Kathy', 'ANDERSON'),
 ('Leo', 'THOMAS')]

In [103]:
%%sql
SELECT first_name, last_name, REPLACE(email, 'example', 'company') AS new_email
FROM employees

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 'alice.smith@company.com'),
 ('Bob', 'Johnson', 'bob.johnson@company.com'),
 ('Carol', 'Williams', 'carol.williams@company.com'),
 ('David', 'Jones', 'david.jones@company.com'),
 ('Eva', 'Brown', 'eva.brown@company.com'),
 ('Frank', 'Davis', 'frank.davis@company.com'),
 ('Grace', 'Miller', 'grace.miller@company.com'),
 ('Henry', 'Wilson', 'henry.wilson@company.com'),
 ('Ivy', 'Moore', 'ivy.moore@company.com'),
 ('Sam', 'White', None),
 ('Jack', 'Taylor', 'jack.taylor@company.com'),
 ('Kathy', 'Anderson', 'kathy.anderson@company.com'),
 ('Leo', 'Thomas', 'leo.thomas@company.com')]

## Combining multiple tables

### Combining multiple table horizontally

Rows across separate tables can be combined using the JOIN clause, which links records based on a common column. This is typically done using a foreign key, which references a primary key in another table. This relationship is expressed using the ON keyword.

In [14]:
%%sql
SELECT *
FROM employees;

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

In [15]:
%%sql
SELECT *
FROM departments;

 * sqlite:///my_database.db
Done.

[(1, 'Engineering', 'New York'),
 (2, 'Sales', 'Los Angeles'),
 (3, 'HR', 'Chicago'),
 (4, 'Marketing', 'San Francisco'),
 (5, 'Finance', 'Boston')]

An INNER JOIN returns only rows with matching values from both tables

In [114]:
%%sql
SELECT e.first_name, e.last_name, d.name
FROM employees e
INNER JOIN departments d ON e.department_id = d.id

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 'Engineering'),
 ('Bob', 'Johnson', 'Engineering'),
 ('Carol', 'Williams', 'Engineering'),
 ('David', 'Jones', 'Sales'),
 ('Eva', 'Brown', 'Sales'),
 ('Frank', 'Davis', 'Sales'),
 ('Grace', 'Miller', 'HR'),
 ('Henry', 'Wilson', 'HR'),
 ('Ivy', 'Moore', 'Marketing'),
 ('Jack', 'Taylor', 'Marketing'),
 ('Kathy', 'Anderson', 'Finance'),
 ('Leo', 'Thomas', 'Finance')]

A LEFT (OUTER) JOIN returns all the rows from the left table, regardless of whether a matching row is found in the right table

In [113]:
%%sql
SELECT e.first_name, e.last_name, d.name
FROM employees e
LEFT JOIN departments d ON e.department_id = d.id

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 'Engineering'),
 ('Bob', 'Johnson', 'Engineering'),
 ('Carol', 'Williams', 'Engineering'),
 ('David', 'Jones', 'Sales'),
 ('Eva', 'Brown', 'Sales'),
 ('Frank', 'Davis', 'Sales'),
 ('Grace', 'Miller', 'HR'),
 ('Henry', 'Wilson', 'HR'),
 ('Ivy', 'Moore', 'Marketing'),
 ('Sam', 'White', None),
 ('Jack', 'Taylor', 'Marketing'),
 ('Kathy', 'Anderson', 'Finance'),
 ('Leo', 'Thomas', 'Finance')]

A RIGHT (OUTER) JOIN (not available in SQLite) returns all the rows from the right table, regardless of whether a matching row is found in the left table. It can be achieved switching the position of the tables and using a LEFT JOIN.

A FULL (OUTER) JOIN (not available in SQLite) returns all the rows from both tables, regardless of whether a matching row exists in the other table

In [16]:
%%sql
SELECT *
FROM employees;

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

A SELF JOIN joins a table with itself, matching rows based on a related column within the same table.

In [118]:
%%sql
SELECT e1.id, e1.first_name || ' ' || e1.last_name AS employee, e2.first_name || ' ' || e2.last_name AS manager
FROM employees e1
LEFT JOIN employees e2
    ON e1.manager_id = e2.id

 * sqlite:///my_database.db
Done.

[(1, 'Alice Smith', None),
 (2, 'Bob Johnson', 'Alice Smith'),
 (3, 'Carol Williams', 'Bob Johnson'),
 (4, 'David Jones', None),
 (5, 'Eva Brown', 'David Jones'),
 (6, 'Frank Davis', 'David Jones'),
 (7, 'Grace Miller', None),
 (8, 'Henry Wilson', 'Grace Miller'),
 (9, 'Ivy Moore', None),
 (10, 'Sam White', 'Carol Williams'),
 (11, 'Jack Taylor', 'Ivy Moore'),
 (12, 'Kathy Anderson', None),
 (13, 'Leo Thomas', 'Jack Taylor')]

A CROSS JOIN returns all possible combinations of rows from both tables, creating a Cartesian product.

### Combining multiple tables vertically

In [17]:
%%sql
SELECT *
FROM employees;

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

UNION combines the results of two queries and removes duplicate rows. UNION ALL retains duplicates.

In [125]:
%%sql
SELECT first_name, last_name, department_id
FROM employees
WHERE department_id = 1

UNION

SELECT first_name, last_name, department_id
FROM employees
WHERE department_id = 2

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 1),
 ('Bob', 'Johnson', 1),
 ('Carol', 'Williams', 1),
 ('David', 'Jones', 2),
 ('Eva', 'Brown', 2),
 ('Frank', 'Davis', 2)]

INTERSECT returns only the rows that are present in the results of both queries, removing duplicates.

In [126]:
%%sql
SELECT first_name, last_name, department_id
FROM employees
WHERE department_id = 1

INTERSECT

SELECT first_name, last_name, department_id
FROM employees
WHERE department_id = 2

 * sqlite:///my_database.db
Done.

[]

EXCEPT returns only the rows from the results of the first query that are not present in the results of the second query, removing duplicates.

In [130]:
%%sql
SELECT first_name, last_name, department_id
FROM employees
WHERE department_id = 1

EXCEPT

SELECT first_name, last_name, department_id
FROM employees
WHERE department_id = 2

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 1), ('Bob', 'Johnson', 1), ('Carol', 'Williams', 1)]

## Handling NULL values

In [18]:
%%sql
SELECT *
FROM employees;

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

IFNULL returns the first argument if it is not NULL; otherwise, it returns the second argument.

In [131]:
%%sql
SELECT first_name, last_name, IFNULL(bonus, 0) AS bonus
FROM employees

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 10000.0),
 ('Bob', 'Johnson', 5000.0),
 ('Carol', 'Williams', 0),
 ('David', 'Jones', 7000.0),
 ('Eva', 'Brown', 3000.0),
 ('Frank', 'Davis', 0),
 ('Grace', 'Miller', 4000.0),
 ('Henry', 'Wilson', 2000.0),
 ('Ivy', 'Moore', 5000.0),
 ('Sam', 'White', 0),
 ('Jack', 'Taylor', 0),
 ('Kathy', 'Anderson', 4500.0),
 ('Leo', 'Thomas', 0)]

COALESCE returns the first non-NULL value among multiple arguments.

In [132]:
%%sql
SELECT first_name, last_name, COALESCE(bonus, 0) AS bonus
FROM employees

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 10000.0),
 ('Bob', 'Johnson', 5000.0),
 ('Carol', 'Williams', 0),
 ('David', 'Jones', 7000.0),
 ('Eva', 'Brown', 3000.0),
 ('Frank', 'Davis', 0),
 ('Grace', 'Miller', 4000.0),
 ('Henry', 'Wilson', 2000.0),
 ('Ivy', 'Moore', 5000.0),
 ('Sam', 'White', 0),
 ('Jack', 'Taylor', 0),
 ('Kathy', 'Anderson', 4500.0),
 ('Leo', 'Thomas', 0)]

In [134]:
%%sql
SELECT first_name, last_name, phone_number, email, COALESCE(phone_number, email, 'N/A') AS contact_info
FROM employees

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', '555-0100', 'alice.smith@example.com', '555-0100'),
 ('Bob', 'Johnson', '555-0101', 'bob.johnson@example.com', '555-0101'),
 ('Carol', 'Williams', '555-0102', 'carol.williams@example.com', '555-0102'),
 ('David', 'Jones', '555-0103', 'david.jones@example.com', '555-0103'),
 ('Eva', 'Brown', '555-0104', 'eva.brown@example.com', '555-0104'),
 ('Frank', 'Davis', '555-0105', 'frank.davis@example.com', '555-0105'),
 ('Grace', 'Miller', '555-0106', 'grace.miller@example.com', '555-0106'),
 ('Henry', 'Wilson', '555-0107', 'henry.wilson@example.com', '555-0107'),
 ('Ivy', 'Moore', '555-0108', 'ivy.moore@example.com', '555-0108'),
 ('Sam', 'White', None, None, 'N/A'),
 ('Jack', 'Taylor', '555-0109', 'jack.taylor@example.com', '555-0109'),
 ('Kathy', 'Anderson', '555-0110', 'kathy.anderson@example.com', '555-0110'),
 ('Leo', 'Thomas', '555-0111', 'leo.thomas@example.com', '555-0111')]

## Specifying conditions

In [19]:
%%sql
SELECT *
FROM employees;

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

CASE returns a value based on the first condition that evaluates to true; if no condition matches, it returns the default value (if provided).

In [139]:
%%sql
SELECT
    first_name,
    last_name,
    performance_rating,
    CASE
        WHEN performance_rating >= 4 THEN 'Excellent'
        WHEN performance_rating = 3 THEN 'Good'
        WHEN performance_rating < 3 THEN 'Insufficient'
        ELSE 'N/A'
    END AS perf_category
FROM employees

 * sqlite:///my_database.db
Done.

[('Alice', 'Smith', 5, 'Excellent'),
 ('Bob', 'Johnson', 4, 'Excellent'),
 ('Carol', 'Williams', 3, 'Good'),
 ('David', 'Jones', 4, 'Excellent'),
 ('Eva', 'Brown', 3, 'Good'),
 ('Frank', 'Davis', 2, 'Insufficient'),
 ('Grace', 'Miller', 4, 'Excellent'),
 ('Henry', 'Wilson', 3, 'Good'),
 ('Ivy', 'Moore', 4, 'Excellent'),
 ('Sam', 'White', None, 'N/A'),
 ('Jack', 'Taylor', 3, 'Good'),
 ('Kathy', 'Anderson', 4, 'Excellent'),
 ('Leo', 'Thomas', 3, 'Good')]

CASE can be used to filter rows based on specified conditions

In [144]:
%%sql
SELECT *
FROm employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

In [143]:
%%sql
SELECT
    first_name,
    last_name,
    salary,
    performance_rating
FROM employees
WHERE
    CASE
        WHEN salary > 100000 THEN performance_rating < 5
        WHEN salary > 80000 THEN performance_rating < 4
        WHEN salary > 60000 THEN performance_rating < 3
    END

 * sqlite:///my_database.db
Done.

[('Frank', 'Davis', 68000.0, 2)]

CASE can also be used inside aggregation function to perform aggregations based on specified conditions

In [150]:
%%sql
SELECT
    COUNT(CASE WHEN performance_rating >= 4 THEN 1 END) AS n_excellent,
    COUNT(CASE WHEN performance_rating = 3 THEN 1 END) AS n_good,
    COUNT(CASE WHEN performance_rating < 3 THEN 1 END) AS n_insufficient
FROM employees

 * sqlite:///my_database.db
Done.

[(6, 5, 1)]

## Window Functions

Window functions perform calculations across a set of table rows. They are defined using the OVER clause, which specifies the "window" of rows to be considered, often partitioned by a column and ordered in a specific way.

In [20]:
%%sql
SELECT *
FROM employees;

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

In [ ]:
%%sql

ROW_NUMBER assigns a unique sequential integer to each row, starting from 1, based on the specified ordering. Rows with the same values receive different row numbers.

RANK assigns a rank to each row, based on the specified ordering. Rows with the same values receive the same rank, and the next rank(s) are skipped.

DENSE_RANK also assigns a rank to each row, but unlike RANK, it does not skip ranks. Rows with the same values receive the same rank, and the next rank follows sequentially.

In [ ]:
%%sql

In [21]:
%%sql
SELECT *
FROM employees;

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

LAG retrieves the value from a previous row, relative to the current row.

LEAD retrieves the value from a subsequent row, relative to the current row.

In [ ]:
%%sql

## Sub-queries

Sub-queries are queries nested within another query, often used to perform intermediate calculations. They return results that are then used by the outer query.

In [22]:
%%sql
SELECT *
FROM employees;

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

In [ ]:
%%sql

In [ ]:
%%sql

In [23]:
%%sql
SELECT *
FROM departments

 * sqlite:///my_database.db
Done.

[(1, 'Engineering', 'New York'),
 (2, 'Sales', 'Los Angeles'),
 (3, 'HR', 'Chicago'),
 (4, 'Marketing', 'San Francisco'),
 (5, 'Finance', 'Boston')]

In [ ]:
%%sql

Sub-queries can be correlated, i.e. they can reference and be dependent on the outer query.

In [ ]:
%%sql

## Common Table Expressions

CTE (Common Table Expressions) define temporary tables (they exist only for the duration of the main query) to store results. They are introduced using the WITH clause and can be referenced like a table within the main query. CTEs improve readability and maintanability, especially for complex queries.

In [ ]:
%%sql

In [ ]:
%%sql

# Exercises

1) Write a query to find first name and last name of employees whose first name:
- has 3 letters
- ends in 'a'

In [ ]:
%%sql

2) Write a query to find, for each department:
- the name of the department
- the number of employees
- the number of employees who received a bonus
- the total amount of bonuses disbursed

In [ ]:
%%sql

Bonus exercise <br>3) Write a query to find employees who received the same bonus as at least one other employee.

In [ ]:
%%sql